configuration/src/Catalogs/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Файлы</name>
  <comment>Хранит информацию о прикрепленных файлах</comment>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивный</name>
    <comment>Признак неактуальности файла</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Каталог</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОригинальноеИмя</name>
    <comment>Оригинальное имя файла</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолучатьИзMinio</name>
    <comment>Временный реквизит для плавного перехода на minio</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла в байтах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <comment>Расширение файла</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/InformationRegisters/ПрикрепленныеФайлы/ПрикрепленныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрикрепленныеФайлы</name>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначенияФайлов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ВладелецПрисоединенныхФайлов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Файл</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/Комментарии/Комментарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Комментарии</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <comment>Текст комментария в HTML</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <comment>Автор комментария</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>Важный</name>
    <comment>Комментарий является важным</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <comment>Дата и время последнего изменения комментария</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторJira</name>
    <comment>Используется для хранения идентификатора комментария из Jira</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Общедоступный</name>
    <comment>Истина - комментарий виден всем, Ложь - виден только группе разработки автора комментария</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаJira</name>
    <comment>Используется для хранения почты автора комментария из Jira</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <comment>Комментарий является служебным</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <comment>Объект-владелец комментария</comment>
    <type>
      <types>DefinedType.ИсточникКомментариев</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКомментария</name>
    <comment>Идентификатор комментария</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/НазначенияФайлов/НазначенияФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияФайлов</name>
  <comment>Определяет нахождение файла к области отображения (форматированный документ или список пркрепленных файлов) </comment>
  <enumValues>
    <name>ИзображениеКомментария</name>
    <comment>Файл используется в комментарии (фактически тот же html)</comment>
  </enumValues>
  <enumValues>
    <name>ИзображениеОписанияДокумента</name>
  </enumValues>
  <enumValues>
    <name>ИзображениеПримечанияРазработчика</name>
  </enumValues>
  <enumValues>
    <name>ИзображениеПримечанияТестировщика</name>
  </enumValues>
  <enumValues>
    <name>ОбрезанныйАватарПользователя</name>
  </enumValues>
  <enumValues>
    <name>Объект</name>
    <comment>Прикреплен непосредственно к объекту</comment>
  </enumValues>
  <enumValues>
    <name>ОписаниеИзмененийКЗадаче</name>
  </enumValues>
  <enumValues>
    <name>ПолныйАватарПользователя</name>
  </enumValues>
  <enumValues>
    <name>ФайлыКомментария</name>
  </enumValues>
  <enumValues>
    <name>ФорматированныйДокумент</name>
    <comment>Файл используется в html-документе</comment>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/Файлы/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает новый элемент справочника и заполняет его реквизиты данными из
// переданных параметров.
//
// Параметры:
//  СвойстваФайла - Структура - структура с описанием свойств файла. Формируется
//                  функцией СвойстваФайла().
//
// Возвращаемое значение:
//  СправочникСсылка.Файлы. Ссылка на созданный элемент справочника.
//
Функция Добавить(Знач СвойстваФайла) Экспорт
	
	НовыйЭлемент = СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, СвойстваФайла, , "Ссылка");
	
	Если ЗначениеЗаполнено(СвойстваФайла.Ссылка) Тогда
		НовыйЭлемент.УстановитьСсылкуНового(СвойстваФайла.Ссылка);
	КонецЕсли;

	НовыйЭлемент.Наименование = СвойстваФайла.ИмяФайла;
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;

КонецФункции

// Изменяет значения реквизитов у существующего элемента справочника.
//
// Параметры:
//  СвойстваФайла - Структура - структура с описанием свойств файла. Формируется
//                  функцией СвойстваФайла().
//
Процедура Изменить(Знач СвойстваФайла) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Файлы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	Файлы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СвойстваФайла.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение "Передана некорректная ссылка на элемент справочника."
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЭлементСправочника = Выборка.Ссылка.ПолучитьОбъект();
	ЗаполнитьЗначенияСвойств(ЭлементСправочника, СвойстваФайла, , "Каталог");
	
	ЭлементСправочника.Наименование = РаботаСФайламиКлиентСервер.ИмяФайлаБезРасширения(ЭлементСправочника.Наименование) 
		+ "." + СвойстваФайла.Расширение;
		
	ЭлементСправочника.Записать();
	
КонецПроцедуры

Функция НайтиЗапись(Знач Владелец, Знач ИмяФайла, Знач Назначение) Экспорт
	
	СвойстваФайла = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Файлы.Ссылка КАК Ссылка,
	|	Файлы.Наименование КАК ИмяФайла,
	|	Файлы.ОригинальноеИмя КАК ОригинальноеИмя,
	|	Файлы.Каталог КАК Каталог
	|ИЗ
	|	РегистрСведений.ПрикрепленныеФайлы КАК ПрикрепленныеФайлы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
	|		ПО ПрикрепленныеФайлы.Файл = Файлы.Ссылка
	|			И (Файлы.Наименование = &ИмяФайла)
	|ГДЕ
	|	ПрикрепленныеФайлы.Объект = &Объект
	|	И ПрикрепленныеФайлы.Назначение = &Назначение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Файлы.Ссылка,
	|	Файлы.Наименование,
	|	Файлы.ОригинальноеИмя,
	|	Файлы.Каталог
	|ИЗ
	|	РегистрСведений.Комментарии КАК Комментарии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрикрепленныеФайлы КАК ПрикрепленныеФайлы
	|		ПО Комментарии.Идентификатор = ПрикрепленныеФайлы.Объект
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
	|		ПО (ПрикрепленныеФайлы.Файл = Файлы.Ссылка)
	|			И (Файлы.Наименование = &ИмяФайла)
	|ГДЕ
	|	Комментарии.Объект = &Объект
	|	И &Назначение В (ЗНАЧЕНИЕ(Перечисление.НазначенияФайлов.Объект), ЗНАЧЕНИЕ(Перечисление.НазначенияФайлов.ФайлыКомментария))";
	
	Запрос.УстановитьПараметр("Объект", Владелец);
	Запрос.УстановитьПараметр("Назначение", Назначение);
	Запрос.УстановитьПараметр("ИмяФайла", ИмяФайла);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		СвойстваФайла = СвойстваФайла();
		ЗаполнитьЗначенияСвойств(СвойстваФайла, Выборка);
	КонецЕсли;
	
	Возврат СвойстваФайла;
	
КонецФункции

// Создает и возвращает структуру со свойствами файла.
//
// Возвращаемое значение:
//  Структура.
//
Функция СвойстваФайла() Экспорт
	
	СвойстваФайла = Новый Структура;
	СвойстваФайла.Вставить("ИмяФайла", "");
	СвойстваФайла.Вставить("ОригинальноеИмя", "");
	СвойстваФайла.Вставить("Каталог", "");
	СвойстваФайла.Вставить("Размер", 0);
	СвойстваФайла.Вставить("Расширение", "");
	СвойстваФайла.Вставить("ИндексКартинки", 0);
	СвойстваФайла.Вставить("Описание", "");
	СвойстваФайла.Вставить("Высота", 0);
	СвойстваФайла.Вставить("Ширина", 0);
	СвойстваФайла.Вставить("ПолучатьИзMinio", Ложь);
	СвойстваФайла.Вставить("НовыйФайл", Ложь);
	
	// СправочникСсылка.Файлы
	СвойстваФайла.Вставить("Ссылка", Неопределено);	
	
	Возврат СвойстваФайла;
	
КонецФункции	

Процедура ПометитьЗаписиНаУдаление(Знач СписокФайлов) Экспорт
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.Файлы"));
	Для Каждого Файл Из СписокФайлов Цикл
		НоваяСтрока = ТаблицаЗначений.Добавить();
		НоваяСтрока.Ссылка = Файл.Значение;
	КонецЦикла;
	
	// Установим блокировку
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.Файлы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ТаблицаЗначений;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
	Блокировка.Заблокировать();
			
	Для Каждого Файл Из СписокФайлов Цикл		
		ЭлементСправочника = Файл.Значение.ПолучитьОбъект();
		ЭлементСправочника.ПометкаУдаления = Истина;
		ЭлементСправочника.Записать();		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
